#pragma once

#include <bit>
#include <type_traits>

#include "fmt/format.h"
#include "hashmap/utils.hpp"
#include "hedley.h"
#include "spdlog/spdlog.h"

#ifdef HASHMAP_IS_X86
#include <x86intrin.h>
#endif

#ifdef HASHMAP_IS_ARM
#include <arm_neon.h>

#ifdef __ARM_FEATURE_SVE
#include <arm_sve.h>
#endif
#endif

#ifdef HASHMAP_IS_POWER
#include <altivec.h>
#endif

enum class SIMDAlgorithm { TESTZ, NO_TESTZ, MANUAL_ON_MATCH };

enum class NEONAlgo { SSE2NEON, AARCH64, UMINV };

template <auto A, typename...>
auto value = A;

template <typename KeyT, uint16_t simd_size = 128, SIMDAlgorithm simd_algo = SIMDAlgorithm::TESTZ, bool use_avx512_features = false,
          bool use_sve = false, NEONAlgo neon_algo = NEONAlgo::SSE2NEON, bool sve_scalar_broadcast = false>
void fail_if_system_is_incompatible() {
#ifndef HASHMAP_USE_SCALAR_IMPL
#ifndef HASHMAP_IS_X86
  static_assert(!use_avx512_features, "AVX-512 can only be used on x86 systems.");
#endif  // HASHMAP_IS_X86

#ifdef HASHMAP_IS_X86
  static_assert(simd_size == 128 || simd_size == 256 || simd_size == 512, "x86 only supports simd_sizes 128,256,512");
  static_assert(!(use_sve || sve_scalar_broadcast), "x86 does not support SVE");

#ifndef __AVX2__
  static_assert(simd_size != 256, "Cannot use simd_size 256 on non AVX2 system");
#endif  //__AVX2__

#ifndef __AVX512F__
  static_assert(simd_size != 512, "Cannot use simd_size 512 on non AVX2 system");
  static_assert(!use_avx512_features, "Cannot use AVX512 features on non-AVX512 system");

#else
  static_assert(!(!use_avx512_features && simd_size == 512), "Can use simd_size 512 only with use_avx512_features==truee");
#endif  // __AVX512F__
#endif  // HASHMAP_IS_X86

#ifdef HASHMAP_IS_ARM
  static_assert(!(!use_sve && sve_scalar_broadcast), "Cannot use SVE scalar broadcast without SVE");
  static_assert(!(use_sve && neon_algo == NEONAlgo::AARCH64), "Cannot use SVE with aarch64 movemask");

  static_assert(!(!use_sve && simd_size != 128), "When not using SVE, we only support SIMD size 128 (NEON)");

  static_assert(!(use_sve && !hashmap::utils::has_sve), "Cannot use SVE on non SVE system or system where we don't know the SVE vector size.");
  static_assert(!use_sve || hashmap::utils::sve_register_size == simd_size,
                "SIMD size does not match sve register size, this application only supports using the entire SVE register currently.");

#endif

#ifdef HASHMAP_IS_POWER
  static_assert(sizeof(unsigned long) == 8, "Unsigned long needs to be 64 bit to have correct mapping between cstdint types and vector types.");
  static_assert(sizeof(unsigned int) == 4, "Unsigned long needs to be 32 bit to have correct mapping between cstdint types and vector types.");
  static_assert(sizeof(unsigned short) == 2, "Unsigned long needs to be 16 bit to have correct mapping between cstdint types and vector types.");
  static_assert(sizeof(unsigned char) == 1, "Unsigned long needs to be 16 bit to have correct mapping between cstdint types and vector types.");

  static_assert(simd_size == 128, "Power only supports 128-bit SIMD");

  static_assert(!(use_sve || neon_algo == NEONAlgo::AARCH64 || use_avx512_features || sve_scalar_broadcast),
                "Using an incompatible option with Power.");

#ifndef _ARCH_PWR9
  static_assert(value<false, KeyT>, "Not on a Power9 compatible system. We need Power9 for vec_first_match_index().");
#endif
#endif
#endif

  static_assert(simd_size % sizeof(KeyT) == 0, "Key size does not align with simd size");
}

template <typename KeyT, uint16_t simd_size, SIMDAlgorithm simd_algo, bool use_avx512_features, bool use_thp, bool use_sve, NEONAlgo neon_algo,
          bool sve_scalar_broadcast>
class SIMDHelper {
 public:
#ifdef HASHMAP_USE_SCALAR_IMPL

  constexpr static uint16_t _vector_alignment() {
    if constexpr (simd_size == 128) {
      return 16;
    }

    if constexpr (simd_size == 256) {
      return 32;
    }

    return 64;
  }
  using vector_type = KeyT*;  // pointer to aligned data
  using LoadPtrT = KeyT*;     // pointer to aligned data

  using _vector_type = vector_type;

  HEDLEY_ALWAYS_INLINE static KeyT* load_func_impl(KeyT* data) { return data; }
  constexpr static auto vector_load_func() { return &load_func_impl; }
  using VectorLoadFuncT = decltype(vector_load_func());
  constexpr static VectorLoadFuncT vector_load_func_ = vector_load_func();
